export default function AboutUsAr() {
  return (
    <main
      dir="rtl"
      className="min-h-screen bg-gray text-neutral-800 px-4 md:px-10 py-16"
    >
      <section className="max-w-5xl mx-auto">
        <h1 className="text-3xl md:text-4xl font-bold mb-6 leading-tight">
          عن جلفا فودز
        </h1>

        <div className="w-full mb-10 overflow-hidden rounded-2xl shadow-sm">
          <img
            src="/Image/About-Us/Factory.jpg"
            alt="مصنع ولفا فودز"
            className="w-full h-[220px] md:h-[auto] object-cover"
          />
        </div>

        <h2 className="text-2xl font-semibold mt-12 mb-4">تاريخ الشركة</h2>

        <p className="text-lg leading-8 mb-6">
          {" "}
          تأسست شركة عصر طلاي برتر أسبادانا في عام 1397 (2018 م) وبدأت عملياتها
          في مجال مختلف منتجات الألبان. تتخصص الشركة في إنتاج جبنة البيتزا عالية
          الجودة وتمكنت من تقديم منتجاتها بشكل فريد في هذه الفئة. بالإضافة إلى
          التوزيع على مستوى الدولة، وخاصة من خلال سلاسل المتاجر الكبيرة، تمكنت
          الشركة من تصدير منتجاتها إلى عدة دول في المنطقة وتستمر في الحفاظ على
          اتجاه نمو وتطور سريع.
        </p>

        <h2 className="text-2xl font-semibold mt-12 mb-4">الجودة والابتكار</h2>

        <p className="text-lg leading-8 mb-6">
          تسعى شركة عصر طلاي برتر أسبادانا جاهدة لتقديم أعلى جودة وأكثر أنواع
          جبنة البيتزا صحة للمستهلكين المحليين والدوليين من خلال الاستفادة من
          مختلف المواد الخام الطازجة والمعدات الصناعية المتقدمة. في هذا الصدد،
          بما يتماشى مع أحدث العلوم العالمية، فإنها تعمل باستمرار على تحسين
          تركيبتها الخاصة للإنتاج.
        </p>

        <h2 className="text-2xl font-semibold mt-12 mb-4">إنجازاتنا</h2>
        <div className="w-full mb-10 overflow-hidden rounded-2xl shadow-sm">
          <img
            src="/Image/About-Us/Awards.webp"
            alt="Jolfa Foods"
            className="w-full h-[220px] md:h-[auto] object-cover"
          />
        </div>
        <p className="text-lg leading-8 mb-6">
          حققت شركة عصر طلاي برتر أسبادانا، مالكة العلامات التجارية جلفا
          ومازيستا، إنجازات قيمة في صناعة الأغذية في البلاد بناءً على الجودة
          والابتكار والخبرة. في عام 1403 (2025 م)، نجحت الشركة في الحصول على
          شهادة التزام بالجودة من الهيئة الوطنية للمعايير الإيرانية وحصلت في
          الوقت نفسه على لقب أفضل وحدة إنتاج في صناعة الأغذية في محافظة أصفهان.
          كما أن تحقيق مركز أفضل مسؤول فني في صناعة الأغذية في محافظة أصفهان،
          مما يدل على قدرات وكفاءة الإدارة الفنية للمجمع، هو أحد إنجازات الشركة
          الأخرى. مواصلةً مسار الابتكار، رسخت شركة عصر طلاي برتر أسبادانا
          مكانتها في تطوير منتجات مبتكرة في صناعة الأغذية في عام 1404 (2025 م)
          من خلال تسجيل براءة اختراع لصلصة الجبن المعالجة.
        </p>
      </section>
    </main>
  );
}
