export default function AboutUsRu() {
  return (
    <main className="min-h-screen bg-gray text-neutral-800 px-4 md:px-10 py-16">
      <section className="max-w-5xl mx-auto">
        <h1 className="text-3xl md:text-4xl font-bold mb-6 leading-tight">
          О компании Jolfa Foods
        </h1>

        <div className="w-full mb-10 overflow-hidden rounded-2xl shadow-sm">
          <img
            src="/Image/About-Us/Factory.jpg"
            alt="Завод Jolfa Foods"
            className="w-full h-[220px] md:h-[auto] object-cover"
          />
        </div>

        <h2 className="text-2xl font-semibold mt-12 mb-4">История компании</h2>

        <p className="text-lg leading-8 mb-6">
          {" "}
          Компания Asr Talaei Bartar Espadana была основана в 2018 году (2018 г.
          н.э.) и начала свою деятельность в области различных молочных
          продуктов. Компания специализируется на производстве
          высококачественного сыра для пиццы и смогла предложить свою продукцию
          уникальным образом в этой категории. Помимо общенациональной
          дистрибуции, особенно через крупные сети магазинов, компания успешно
          экспортировала свою продукцию в несколько стран региона и продолжает
          поддерживать тенденцию быстрого роста и развития.
        </p>

        <h2 className="text-2xl font-semibold mt-12 mb-4">
          Качество и инновации
        </h2>

        <p className="text-lg leading-8 mb-6">
          Компания Asr Talaei Bartar Espadana стремится предлагать потребителям
          внутреннего и внешнего рынка сыр для пиццы высочайшего качества и
          наиболее полезный, используя различные свежие сырьевые материалы и
          современное промышленное оборудование. В этом отношении, в
          соответствии с последними мировыми научными знаниями, она постоянно
          совершенствует свою специальную формулу производства.
        </p>

        <h2 className="text-2xl font-semibold mt-12 mb-4">Наши достижения</h2>
        <div className="w-full mb-10 overflow-hidden rounded-2xl shadow-sm">
          <img
            src="/Image/About-Us/Awards.webp"
            alt="Jolfa Foods"
            className="w-full h-[220px] md:h-[auto] object-cover"
          />
        </div>
        <p className="text-lg leading-8 mb-6">
          Компания Asr Talaei Bartar Espadana, владеющая торговыми марками Jolfa
          и Mazesta, добилась ценных успехов в пищевой промышленности страны
          благодаря качеству, инновациям и опыту. В 2025 году (2025 г. н.э.)
          компания успешно получила сертификат соответствия требованиям качества
          от Национального стандарта Ирана и одновременно получила звание лучшей
          производственной единицы пищевой промышленности провинции Исфахан.
          Кроме того, получение должности лучшего технического специалиста
          пищевой промышленности провинции Исфахан, что свидетельствует о
          способностях и квалификации технического руководства комплекса,
          является еще одним достижением компании. Продолжая путь инноваций,
          компания Asr Talaei Bartar Espadana укрепила свои позиции в разработке
          продуктов питания на основе научных знаний в 2025 году (2025 г. н.э.)
          путем регистрации патента на обработанный сырный соус.
        </p>
      </section>
    </main>
  );
}
